"""
vim - запуск
vim filename - открыть файл
vim file1 file2... - открыть файлы

:help - справка
:q - выход

vimtutor - туториал

// перемещение

по символам
hjkl - вверх, вниз, влево, вправо
стрелки

по словам
w, W - в начало следующего слова
e, E - в конец следующего слова
b, B - в начало предыдущего слова

по строкам
0 - в начало строки
^ - в начало слова
$ - в конец строки

gg - в начало документа
G - в конец документа
:21 - в строку 21

// удаление
x - удалить символ
X - удалить слово
de - удалить до конца текущего слова
d$ - удалить до конца строки
d5w - удалить 5 слов
dd - удалить текущую строку
d10d - удалить 10 строк

// создание
i - войти в режим вставки
a - войти в режим вставки после текущего символа

// копирование
y <кол-во> <ход> - копировать
yy - копировать текущую строку
p - вставить перед
P - вставить после

















"""