"""

wget ссылка - скачать файл и сохранить в текущей директории

wget -P путь_до_директории ссылка - скачать файл и сохранить в указанную директорию

wget -O путь_до_файла ссылка - скачать файл и сохранить под указанным именем

wget -c ссылка - продолжить скачивание в случае возникновения ошибки

wget --spider ссылка - проверка доступность файла

wget -i файл_с_ссылками - скачивание нескольких файлов из списка

wget -q ссылка - не выводить информацию

wget -r -l глубина ссылка - рекурсивно скачать все файлы на указанную глубину (глубина по умолчанию 5)

wget -r -A расширение1,расширение2... ссылка - рекурсивно скачать все файлы с указанным расширением


















"""